tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

# git & git adjacent
brew 'git'
brew 'git-delta'
brew 'git-lfs'
brew 'gh'
brew 'pre-commit'

# encryption + yubikey
brew 'gnupg'
brew 'pinentry-mac'
brew 'ykman'

# containers
cask 'docker'
brew 'helm'

# networking
brew 'gping' # ping with a graph: gping google.com
brew 'httpie' # friendly curl: http HEAD google.com
cask 'ngrok'
brew 'nmap'
brew 'openssh'
cask 'postman'
brew 'telnet'

# utilities
brew 'bat' # prettier cat
brew 'coreutils' # GNU-style core file utils. Prefix command with 'g', (gsed instead of sed)
brew 'fzf' # fuzzy finder: fzf
brew 'jq' # json processing: echo '{"hi":"world"}' | jq '.hi'
brew 'tldr' # simplified manual pages: tldr man
brew 'tokei' # stats about code: tokei .
brew 'tree' # visual output of directories: tree -L 3 .
brew 'watch' # re-execute a command in a loop: watch -n 1 date -u
brew 'wget'
brew 'yq' # yaml processing: echo 'hi: world' | yq eval '.hi' -
brew 'zoxide' # smart cd. Use 'z' instead of 'cd'

# languages
brew 'uv'

brew 'chruby'
brew 'ruby-install'

brew 'nvm'

brew 'go'

brew 'warrensbox/tap/tfswitch'

# other
brew 'awscli'
brew 'cmake'
brew 'shellcheck'

cask 'iterm2'
cask 'meetingbar'
cask 'monitorcontrol'
cask 'rectangle'
cask 'spotify'

cask 'cursor'
cask 'visual-studio-code'

cask 'font-meslo-for-powerline'

brew 'duti' # cli to set default apps for documents
